{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "10",
    "1": "40",
    "2": "50",
    "3": "60",
    "4": "1140",
    "5": "1160",
    "6": "1180",
    "7": "1280",
    "8": "1281",
    "9": "1300",
    "10": "1301",
    "11": "1302",
    "12": "1320",
    "13": "1560",
    "14": "1920",
    "15": "1940",
    "16": "2060",
    "17": "2220",
    "18": "2280",
    "19": "2403",
    "20": "2462",
    "21": "2522",
    "22": "2582",
    "23": "2583",
    "24": "2585",
    "25": "2705",
    "26": "2905"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "10": 0,
    "1140": 4,
    "1160": 5,
    "1180": 6,
    "1280": 7,
    "1281": 8,
    "1300": 9,
    "1301": 10,
    "1302": 11,
    "1320": 12,
    "1560": 13,
    "1920": 14,
    "1940": 15,
    "2060": 16,
    "2220": 17,
    "2280": 18,
    "2403": 19,
    "2462": 20,
    "2522": 21,
    "2582": 22,
    "2583": 23,
    "2585": 24,
    "2705": 25,
    "2905": 26,
    "40": 1,
    "50": 2,
    "60": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
